# yolov5_character.yaml - Modified for 160x128 input

nc: 36

depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [3,5, 6,10, 12,19]    # stride 4
  - [10,13, 16,30, 33,23]   # stride 8
  - [30,61, 62,45, 59,119]  # stride 16

backbone:
  - [-1, 1, Conv, [64, 6, 2, 2]]        # 160x128 -> 80x64
  - [-1, 1, Conv, [128, 3, 2]]          # 80x64 -> 40x32
  - [-1, 3, BottleneckCSP, [128]]
  - [-1, 1, Conv, [256, 3, 2]]          # 40x32 -> 20x16
  - [-1, 3, BottleneckCSP, [256]]
  - [-1, 1, Conv, [512, 3, 2]]          # 20x16 -> 10x8 (STOP HERE)
  - [-1, 1, SPPF, [512, 5]]

head:
  # P5 to P4 fusion (stride 16 to stride 8)
  - [-1, 1, Conv, [256, 1, 1]]        # Conv on P5 (output of SPPF, layer 6 in backbone)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # Upsample P5 (10x8) -> 20x16
  - [[-1, 4], 1, Concat, [1]]         # Concat with P4 from backbone (layer 4, 20x16)
  - [-1, 3, BottleneckCSP, [256]]     # P4 output for detection (stride 8)

  # P4 to P3 fusion (stride 8 to stride 4)
  - [-1, 1, Conv, [128, 1, 1]]        # Conv on P4 (output of above BottleneckCSP)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # Upsample P4 (20x16) -> 40x32
  - [[-1, 2], 1, Concat, [1]]         # Concat with P3 from backbone (layer 2, 40x32)
  - [-1, 3, BottleneckCSP, [128]]     # P3 output for detection (stride 4)

  # Detection Layer
  # Inputs: [P3 (stride 4), P4 (stride 8), P5 (stride 16)]
  - [[-1, 10, 6], 1, Detect, [nc, anchors]] # -1 is the P3 output, 10 is P4, 6 is P5